In [12]:
import numpy as np
import pandas as pd

In [13]:
s = pd.Series([1,2,3,4,5,6,np.nan,8,9,10])
print(s)

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     NaN
7     8.0
8     9.0
9    10.0
dtype: float64

In [17]:
s = pd.date_range('20220403',periods=10)
df = pd.DataFrame(s)
print(df)

           0
0 2022-04-03
1 2022-04-04
2 2022-04-05
3 2022-04-06
4 2022-04-07
5 2022-04-08
6 2022-04-09
7 2022-04-10
8 2022-04-11
9 2022-04-12

In [33]:
df = pd.DataFrame({ 'name' : np.array(['nani','sudheer','vishnu','karthik','raghu']),
                    'age' : np.array(['22','23','21','22','23']),
                    'branch' :  np.array(['AIDS','IT','CSE','EEE','ECE'])})
print(df)

      name age branch
0     nani  22   AIDS
1  sudheer  23     IT
2   vishnu  21    CSE
3  karthik  22    EEE
4    raghu  23    ECE

In [34]:
df.dtypes

name      object
age       object
branch    object
dtype: object

In [35]:
df.head()

      name age branch
0     nani  22   AIDS
1  sudheer  23     IT
2   vishnu  21    CSE
3  karthik  22    EEE
4    raghu  23    ECE

In [36]:
df.tail()

      name age branch
0     nani  22   AIDS
1  sudheer  23     IT
2   vishnu  21    CSE
3  karthik  22    EEE
4    raghu  23    ECE

In [37]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [38]:
df.columns

Index(['name', 'age', 'branch'], dtype='object')

In [39]:
df.describe()

        name age branch
count      5   5      5
unique     5   3      5
top     nani  22   AIDS
freq       1   2      1

In [41]:
df.sort_index(axis=1,ascending=True)

  age branch     name
0  22   AIDS     nani
1  23     IT  sudheer
2  21    CSE   vishnu
3  22    EEE  karthik
4  23    ECE    raghu

In [42]:
df.sort_values(by='age')

      name age branch
2   vishnu  21    CSE
0     nani  22   AIDS
3  karthik  22    EEE
1  sudheer  23     IT
4    raghu  23    ECE

In [43]:
df['branch']

0    AIDS
1      IT
2     CSE
3     EEE
4     ECE
Name: branch, dtype: object

In [44]:
df[0:3]

      name age branch
0     nani  22   AIDS
1  sudheer  23     IT
2   vishnu  21    CSE

In [50]:
df.loc[:,['age','branch']]

  age branch
0  22   AIDS
1  23     IT
2  21    CSE
3  22    EEE
4  23    ECE

In [52]:
df.loc['0':'2',['branch','age']]

  branch age
0   AIDS  22
1     IT  23
2    CSE  21

In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("H:\company_sales_data.csv")

In [8]:
df.head(7)

,month_number,facecream,facewash,toothpaste,bathingsoap,shampoo,moisturizer,total_units,total_profit
0,1,2500,1500,5200,9200,1200,1500,21100,211000
1,2,2630,1200,5100,6100,2100,1200,18330,183300
2,3,2140,1340,4550,9550,3550,1340,22470,224700
3,4,3400,1130,5870,8870,1870,1130,22270,222700
4,5,3600,1740,4560,7760,1560,1740,20960,209600
5,6,2760,1555,4890,7490,1890,1555,20140,201400
6,7,2980,1120,4780,8980,1780,1120,29550,295500

In [6]:
df.tail()

,month_number,facecream,facewash,toothpaste,bathingsoap,shampoo,moisturizer,total_units,total_profit
7,8,3700,1400,5860,9960,2860,1400,36140,361400
8,9,3540,1780,6100,8100,2100,1780,23400,234000
9,10,1990,1890,8300,10300,2300,1890,26670,266700
10,11,2340,2100,7300,13300,2400,2100,41280,412800
11,12,2900,1760,7400,14400,1800,1760,30020,300200

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   month_number  12 non-null     int64
 1   facecream     12 non-null     int64
 2   facewash      12 non-null     int64
 3   toothpaste    12 non-null     int64
 4   bathingsoap   12 non-null     int64
 5   shampoo       12 non-null     int64
 6   moisturizer   12 non-null     int64
 7   total_units   12 non-null     int64
 8   total_profit  12 non-null     int64
dtypes: int64(9)
memory usage: 992.0 bytes

In [12]:
df['shampoo'].value_counts()

2100    2
1200    1
3550    1
1870    1
1560    1
1890    1
1780    1
2860    1
2300    1
2400    1
1800    1
Name: shampoo, dtype: int64

# NEW-EXCERISE

In [3]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data,index=labels)
print(df)
total_rows = len(df.axes[0])
total_columns = len(df.axes[1])
print(" rows : ",total_rows)
print(" columns : ",total_columns)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
 rows :  10
 columns :  4

In [4]:
missing_row = df[df['score'].isnull()]
print(missing_row)

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

# Write a Pandas program to select the rows the score is between 15 and 20 (inclusive)

In [5]:
rows = df[df['score'].between(15,20)]
print(rows)

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

# Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

In [6]:
rows = df[(df['attempts'] < 2) & (df['score'] > 15)]
print(rows)

    name  score  attempts qualify
j  Jonas   19.0         1     yes

# Write a Pandas program to change the score in row 'd' to 11.5.

In [7]:
row = df.loc['d','score'] = 11.5
print(row)

11.5

In [8]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

# Write a Pandas program to calculate the sum of the examination attempts by the students.

In [9]:
sums = df['attempts'].sum()
print(" sum of examination attempts : ",sums)

 sum of examination attempts :  19

# Write a Pandas program to calculate the mean score for each different student in DataFrame.

In [10]:
mean_score = df['score'].mean()
print(" mean score : ",mean_score)

 mean score :  13.333333333333334

In [11]:
print(" original rows : ")
print(df)
print(" -- adding a new row -- ")
df.loc['k'] = ["suresh",15.5,1,"yes"]
print(df)
print(" -- deleting the row added -- ")
df = df.drop('k')
print(df)

 original rows :
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
 -- adding a new row --
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     suresh   15.5         1     yes
 -- deleting the row added --
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

# Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.

In [12]:
df.sort_values(by=['name','score'],ascending=[False,True])
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

# Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False

In [13]:
df['qualify'] = df['qualify'].map({'yes':True,'no':False})
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James   11.5         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

# Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame.

In [14]:
df['name'] = df['name'].replace('James','suresh')
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d     suresh   11.5         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

# Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [15]:
df.pop('attempts')
df

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d     suresh   11.5    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True

# Write a Pandas program to insert a new column in existing DataFrame.

In [16]:
color = ['red','green','yellow','white','cyan','pink','brown','black','blue','green']
df['color'] = color
df

        name  score  qualify   color
a  Anastasia   12.5     True     red
b       Dima    9.0    False   green
c  Katherine   16.5     True  yellow
d     suresh   11.5    False   white
e      Emily    9.0    False    cyan
f    Michael   20.0     True    pink
g    Matthew   14.5     True   brown
h      Laura    NaN    False   black
i      Kevin    8.0    False    blue
j      Jonas   19.0     True   green

In [19]:
for index , row in df.iterrows():
    print(df['name'],df['score'])

a    Anastasia
b         Dima
c    Katherine
d       suresh
e        Emily
f      Michael
g      Matthew
h        Laura
i        Kevin
j        Jonas
Name: name, dtype: object a    12.5
b     9.0
c    16.5
d    11.5
e     9.0
f    20.0
g    14.5
h     NaN
i     8.0
j    19.0
Name: score, dtype: float64
a    Anastasia
b         Dima
c    Katherine
d       suresh
e        Emily
f      Michael
g      Matthew
h        Laura
i        Kevin
j        Jonas
Name: name, dtype: object a    12.5
b     9.0
c    16.5
d    11.5
e     9.0
f    20.0
g    14.5
h     NaN
i     8.0
j    19.0
Name: score, dtype: float64
a    Anastasia
b         Dima
c    Katherine
d       suresh
e        Emily
f      Michael
g      Matthew
h        Laura
i        Kevin
j        Jonas
Name: name, dtype: object a    12.5
b     9.0
c    16.5
d    11.5
e     9.0
f    20.0
g    14.5
h     NaN
i     8.0
j    19.0
Name: score, dtype: float64
a    Anastasia
b         Dima
c    Katherine
d       suresh
e        Emily
f      Michael
g      Matthew
h        Laura
i        Kevin
j        Jonas
Name: name, dtype: object a    12.5
b     9.0
c    16.5
d    11.5
e     9.0
f    20.0
g    14.5
h     NaN
i     8.0
j    19.0
Name: score, dtype: float64
a    Anastasia
b         Dima
c    Katherine
d       suresh
e        Emily
f      Michael
g      Matthew
h        Laura
i        Kevin
j        Jonas
Name: name, dtype: object a    12.5
b     9.0
c    16.5
d    11.5
e     9.0
f    20.0
g    14.5
h     NaN
i     8.0
j    19.0
Name: score, dtype: float64
a    Anastasia
b         Dima
c    Katherine
d       suresh
e        Emily
f      Michael
g      Matthew
h        Laura
i        Kevin
j        Jonas
Name: name, dtype: object a    12.5
b     9.0
c    16.5
d    11.5
e     9.0
f    20.0
g    14.5
h     NaN
i     8.0
j    19.0
Name: score, dtype: float64
a    Anastasia
b         Dima
c    Katherine
d       suresh
e        Emily
f      Michael
g      Matthew
h        Laura
i        Kevin
j        Jonas
Name: name, dtype: object a    12.5
b     9.0
c    16.5
d    11.5
e     9.0
f    20.0
g    14.5
h     NaN
i     8.0
j    19.0
Name: score, dtype: float64
a    Anastasia
b         Dima
c    Katherine
d       suresh
e        Emily
f      Michael
g      Matthew
h        Laura
i        Kevin
j        Jonas
Name: name, dtype: object a    12.5
b     9.0
c    16.5
d    11.5
e     9.0
f    20.0
g    14.5
h     NaN
i     8.0
j    19.0
Name: score, dtype: float64
a    Anastasia
b         Dima
c    Katherine
d       suresh
e        Emily
f      Michael
g      Matthew
h        Laura
i        Kevin
j        Jonas
Name: name, dtype: object a    12.5
b     9.0
c    16.5
d    11.5
e     9.0
f    20.0
g    14.5
h     NaN
i     8.0
j    19.0
Name: score, dtype: float64
a    Anastasia
b         Dima
c    Katherine
d       suresh
e        Emily
f      Michael
g      Matthew
h        Laura
i        Kevin
j        Jonas
Name: name, dtype: object a    12.5
b     9.0
c    16.5
d    11.5
e     9.0
f    20.0
g    14.5
h     NaN
i     8.0
j    19.0
Name: score, dtype: float64

# Write a Pandas program to get list from DataFrame column headers.

In [22]:
print(list(df.columns.values))

['name', 'score', 'qualify', 'color']

# Write a Pandas program to rename columns of a given DataFrame

In [24]:
df = df.rename(columns={'name':'NAME','score':'SCORE','qualify':'QUALIFY','color':'COLOR'})
df

        NAME  SCORE  QUALIFY   COLOR
a  Anastasia   12.5     True     red
b       Dima    9.0    False   green
c  Katherine   16.5     True  yellow
d     suresh   11.5    False   white
e      Emily    9.0    False    cyan
f    Michael   20.0     True    pink
g    Matthew   14.5     True   brown
h      Laura    NaN    False   black
i      Kevin    8.0    False    blue
j      Jonas   19.0     True   green

# Write a Pandas program to select rows from a given DataFrame based on values in some columns.

In [26]:
print(df.loc[df['QUALIFY'] == True])

        NAME  SCORE  QUALIFY   COLOR
a  Anastasia   12.5     True     red
c  Katherine   16.5     True  yellow
f    Michael   20.0     True    pink
g    Matthew   14.5     True   brown
j      Jonas   19.0     True   green

# Write a Pandas program to write a DataFrame to CSV file using tab separator.

In [27]:
df.to_csv("new_file_company_sales_data.csv" ,sep="\t",index=False)
file = pd.read_csv("new_file_company_sales_data.csv")
print(file)

     NAME\tSCORE\tQUALIFY\tCOLOR
0     Anastasia\t12.5\tTrue\tred
1        Dima\t9.0\tFalse\tgreen
2  Katherine\t16.5\tTrue\tyellow
3     suresh\t11.5\tFalse\twhite
4        Emily\t9.0\tFalse\tcyan
5      Michael\t20.0\tTrue\tpink
6     Matthew\t14.5\tTrue\tbrown
7          Laura\t\tFalse\tblack
8        Kevin\t8.0\tFalse\tblue
9       Jonas\t19.0\tTrue\tgreen

# Write a Pandas program to count city wise number of people from a given of data set (city, name of the person).

In [29]:
import pandas as pd
df1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})
gf = df1.groupby(['city']).size().reset_index(name=" number of people")
gf

          city   number of people
0   California                  4
1      Georgia                  2
2  Los Angeles                  4

# Write a Pandas program to delete DataFrame row(s) based on given column value.

In [30]:
import pandas as pd
import numpy as np
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
df = df[df.col2 != 5]
print("New DataFrame")
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
New DataFrame
   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

# Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.

In [37]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print("Original DataFrame")
print(df)
df =  df.fillna(0)
print("\nNew DataFrame replacing all NaN with 0:")
print(df)

Original DataFrame
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

New DataFrame replacing all NaN with 0:
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

# Write a Pandas program to count the NaN values in one or more columns in DataFrame.

In [39]:
print(df.isnull().values.sum())

0

# Write a Pandas program to drop a list of rows from a specified DataFrame.

In [40]:
print("New DataFrame after removing 2nd & 4th rows:")
df = df.drop(df.index[[2,4]])
print(df)

New DataFrame after removing 2nd & 4th rows:
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
3      James    0.0         3      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

# Write a Pandas program to count number of columns of a DataFrame.

In [43]:
print(len(df.columns))

4